{
  "products": [
    {
      "name": "Nguyên Tắc 50 - Không Sợ Hãi (Tái Bản 2022)",
      "img": "https://cdn0.fahasa.com/media/catalog/product/8/9/8934974181545.jpg",
      "description": "Sợ hãi là một trong những cảm xúc nguyên thủy nhất mà mỗi người cảm nhận được ngay từ lúc chào đời. Không ai thoát khỏi quy luật chung này. Vì vậy, vượt qua sợ hãi, với tất cả hình thức cung bậc đa dạng của nó, không phải là điều tự nhiên đến mà là kết quả của một quá trình nỗ lực kiên trì, có ý thức, có phương pháp. Robert Greene đã trình bày trong cuốn sách của mình, thông qua 10 chương sách, 10 chiến lược hành động khác nhau để vượt qua những khía cạnh khác nhau của cảm giác sợ hãi. Những gì được viết ra trong cuốn sách không phải là điều gì mới lạ do tác giả phát minh ra, mà đơn thuần chỉ là sự tổng kết có hệ thống những phương cách mà nhiều nhân vật nổi tiếng trong lịch sử thuộc mọi lĩnh vực - từ chính trị, quân sự đến kinh doanh, từ thể thao đỉnh cao đến nghiên cứu khoa học – đã áp dụng thành công để vượt qua nỗi sợ hãi của chính họ nhằm tiến tới thành công. Bên cạnh những khuôn mặt nổi tiếng trong lịch sử, Greene dẫn dắt bạn đọc theo con đường vươn lên của ca sĩ nổi tiếng 50 Cent từ một đứa trẻ lang thang bán ma túy trên đường phố trở thành ông chủ đầy quyền lực của một đế chế kinh doanh phát đạt, cũng như cách mà anh vượt qua những thử thách mới, những nỗi sợ hãi mới gặp phải trong mỗi giai đoạn của cuộc sống.  Mã hàng\t8934974181545 Tên Nhà Cung Cấp\tNXB Trẻ Tác giả\t50 Cent, Robert Greene Người Dịch\tLê Đình Chi NXB\tTrẻ Năm XB\t2022 Trọng lượng (gr)\t350 Kích Thước Bao Bì\t20.5 x 13 x 1.5 Số trang\t336 Hình thức\tBìa Mềm Sản phẩm hiển thị trong\t NXB Trẻ Sản phẩm bán chạy nhất\tTop 100 sản phẩm Kỹ năng sống bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Sợ hãi là một trong những cảm xúc nguyên thủy nhất mà mỗi người cảm nhận được ngay từ lúc chào đời. Không ai thoát khỏi quy luật chung này. Vì vậy, vượt qua sợ hãi, với tất cả hình thức cung bậc đa dạng của nó, không phải là điều tự nhiên đến mà là kết quả của một quá trình nỗ lực kiên trì, có ý thức, có phương pháp. Robert Greene đã trình bày trong cuốn sách của mình, thông qua 10 chương sách, 10 chiến lược hành động khác nhau để vượt qua những khía cạnh khác nhau của cảm giác sợ hãi. Những gì được viết ra trong cuốn sách không phải là điều gì mới lạ do tác giả phát minh ra, mà đơn thuần chỉ là sự tổng kết có hệ thống những phương cách mà nhiều nhân vật nổi tiếng trong lịch sử thuộc mọi lĩnh vực - từ chính trị, quân sự đến kinh doanh, từ thể thao đỉnh cao đến nghiên cứu khoa học – đã áp dụng thành công để vượt qua nỗi sợ hãi của chính họ nhằm tiến tới thành công. Bên cạnh những khuôn mặt nổi tiếng trong lịch sử, Greene dẫn dắt bạn đọc theo con đường vươn lên của ca sĩ nổi tiếng 50 Cent từ một đứa trẻ lang thang bán ma túy trên đường phố trở thành ông chủ đầy quyền lực của một đế chế kinh doanh phát đạt, cũng như cách mà anh vượt qua những thử thách mới, những nỗi sợ hãi mới gặp phải trong mỗi giai đoạn của cuộc sống.",
      "author": "50 Cent, Robert Greene",
      "category": "",
      "price": "130000",
      "status": true,
      "id": 1,
      "sale": "110500"
    },
    {
      "name": "Đọc Vị Bất Kỳ Ai (Tái Bản 2022)",
      "img": "https://cdn0.fahasa.com/media/catalog/product/b/i/bia_doc-vi-bat-ky-ai-de-khong-bi-lua-doi-va-loi-dung_bia-1.jpg",
      "description": "Bạn băn khoăn không biết người ngồi đối diện đang nghĩ gì? Họ có đang nói dối bạn không? Đối tác đang ngồi đối diện với bạn trên bàn đàm phán đang nghĩ gì và nói gì tiếp theo?  ĐỌC người khác là một trong những công cụ quan trọng, có giá trị nhất, giúp ích cho bạn trong mọi khía cạnh của cuộc sống. ĐỌC VỊ người khác để:  Hãy chiếm thế thượng phong trong việc chủ động nhận biết điều cần tìm kiếm - ở bất kỳ ai bằng cách “thâm nhập vào suy nghĩ” của người khác. ĐỌC VỊ BẤT KỲ AI là cẩm nang dạy bạn cách thâm nhập vào tâm trí của người khác để biết điều người ta đang nghĩ. Cuốn sách này sẽ không giúp bạn rút ra các kết luận chung về một ai đó dựa vào cảm tính hay sự võ đoán. Những nguyên tắc được chia sẻ trong cuốn sách này không đơn thuần là những lý thuyết hay mẹo vặt chỉ đúng trong một số trường hợp hoặc với những đối tượng nhất định. Các kết quả nghiên cứu trong cuốn sách này được đưa ra dựa trên phương pháp S.N.A.P - cách thức phân tích và tìm hiểu tính cách một cách bài bản trong phạm vi cho phép mà không làm mếch lòng đối tượng được phân tích. Phương pháp này dựa trên những phân tích về tâm lý, chứ không chỉ đơn thuần dựa trên ngôn ngữ cử chỉ, trực giác hay võ đoán.  Cuốn sách được chia làm hai phần và 15 chương:  Phần 1: Bảy câu hỏi cơ bản: Học cách phát hiện ra điều người khác nghĩ hay cảm nhận một cách dễ dàng và nhanh chóng trong bất kỳ hoàn cảnh nào.  Phần 2: Những kế hoạch chi tiết cho hoạt động trí óc - hiểu được quá trình ra quyết định. Vượt ra ngoài việc đọc các suy nghĩ và cảm giác đơn thuần: Hãy học cách người khác suy nghĩ để có thể nắm bắt bất kỳ ai, phán đoán hành xử và hiểu được họ còn hơn chính bản thân họ.  Trích đoạn sách hay:  Một giám đốc phụ trách bán hàng nghi ngờ một trong những nhân viên kinh doanh của mình đang biển thủ công quỹ. Nếu hỏi trực tiếp “Có phải cô đang lấy trộm đồ của công ty?” sẽ khiến người bị nghi ngờ phòng bị ngay lập tức, việc muốn tìm ra chân tướng sự việc càng trở nên khó khăn hơn. Nếu cô ta không làm việc đó, dĩ nhiên cô ta sẽ nói với người giám đốc mình không lấy trộm. Ngược lại, dù có lấy trộm đi chăng nữa, cô ta cũng sẽ nói dối mình không hề làm vậy. Thay vào việc hỏi trực diện, người giám đốc khôn ngoan nên nói một điều gì đó tưởng chừng vô hại, như “Jill, không biết cô có giúp được tôi việc này không. Có vẻ như dạo này có người trong phòng đang lấy đồ của công ty về nhà phục vụ cho tư lợi cá nhân. Cô có hướng giải quyết nào cho việc này không?” rồi bình tĩnh quan sát phản ứng của người nhân viên.  Nếu cô ta hỏi lại và có vẻ hứng thú với đề tài này, anh ta có thể tạm an tâm rằng cô ta không lấy trộm, còn nếu cô ta đột nhiên trở nên không thoải mái và tìm cách thay đổi đề tài thì rõ ràng cô ta có động cơ không trong sáng.  Người giám đốc khi đó sẽ nhận ra sự chuyển hướng đột ngột trong thái độ và hành vi của người nhân viên. Nếu cô gái đó hoàn toàn trong sạch, có lẽ cô ta sẽ đưa ra hướng giải quyết của mình và vui vẻ khi sếp hỏi ý kiến của mình. Ngược lại, cô ta sẽ có biểu hiện không thoải mái rõ ràng và có lẽ sẽ cố cam đoan với sếp rằng cô không đời nào làm việc như vậy. Không có lí do gì để cô ta phải thanh minh như vậy, trừ phi cô là người có cảm giác tội lỗi…  Mã hàng\t8935280912304 Tên Nhà Cung Cấp\tThái Hà Tác giả\tTS David J Lieberman NXB\tLao Động Năm XB\t2022 Ngôn Ngữ\tTiếng Việt Trọng lượng (gr)\t250 Kích Thước Bao Bì\t20.5 x 13 cm Số trang\t223 Hình thức\tBìa Mềm Sản phẩm bán chạy nhất\tTop 100 sản phẩm Kỹ năng sống bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Bạn băn khoăn không biết người ngồi đối diện đang nghĩ gì? Họ có đang nói dối bạn không? Đối tác đang ngồi đối diện với bạn trên bàn đàm phán đang nghĩ gì và nói gì tiếp theo?  ĐỌC người khác là một trong những công cụ quan trọng, có giá trị nhất, giúp ích cho bạn trong mọi khía cạnh của cuộc sống. ĐỌC VỊ người khác để:  Hãy chiếm thế thượng phong trong việc chủ động nhận biết điều cần tìm kiếm - ở bất kỳ ai bằng cách “thâm nhập vào suy nghĩ” của người khác. ĐỌC VỊ BẤT KỲ AI là cẩm nang dạy bạn cách thâm nhập vào tâm trí của người khác để biết điều người ta đang nghĩ. Cuốn sách này sẽ không giúp bạn rút ra các kết luận chung về một ai đó dựa vào cảm tính hay sự võ đoán. Những nguyên tắc được chia sẻ trong cuốn sách này không đơn thuần là những lý thuyết hay mẹo vặt chỉ đúng trong một số trường hợp hoặc với những đối tượng nhất định. Các kết quả nghiên cứu trong cuốn sách này được đưa ra dựa trên phương pháp S.N.A.P - cách thức phân tích và tìm hiểu tính cách một cách bài bản trong phạm vi cho phép mà không làm mếch lòng đối tượng được phân tích. Phương pháp này dựa trên những phân tích về tâm lý, chứ không chỉ đơn thuần dựa trên ngôn ngữ cử chỉ, trực giác hay võ đoán.  Cuốn sách được chia làm hai phần và 15 chương:  Phần 1: Bảy câu hỏi cơ bản: Học cách phát hiện ra điều người khác nghĩ hay cảm nhận một cách dễ dàng và nhanh chóng trong bất kỳ hoàn cảnh nào.  Phần 2: Những kế hoạch chi tiết cho hoạt động trí óc - hiểu được quá trình ra quyết định. Vượt ra ngoài việc đọc các suy nghĩ và cảm giác đơn thuần: Hãy học cách người khác suy nghĩ để có thể nắm bắt bất kỳ ai, phán đoán hành xử và hiểu được họ còn hơn chính bản thân họ.  Trích đoạn sách hay:  Một giám đốc phụ trách bán hàng nghi ngờ một trong những nhân viên kinh doanh của mình đang biển thủ công quỹ. Nếu hỏi trực tiếp “Có phải cô đang lấy trộm đồ của công ty?” sẽ khiến người bị nghi ngờ phòng bị ngay lập tức, việc muốn tìm ra chân tướng sự việc càng trở nên khó khăn hơn. Nếu cô ta không làm việc đó, dĩ nhiên cô ta sẽ nói với người giám đốc mình không lấy trộm. Ngược lại, dù có lấy trộm đi chăng nữa, cô ta cũng sẽ nói dối mình không hề làm vậy. Thay vào việc hỏi trực diện, người giám đốc khôn ngoan nên nói một điều gì đó tưởng chừng vô hại, như “Jill, không biết cô có giúp được tôi việc này không. Có vẻ như dạo này có người trong phòng đang lấy đồ của công ty về nhà phục vụ cho tư lợi cá nhân. Cô có hướng giải quyết nào cho việc này không?” rồi bình tĩnh quan sát phản ứng của người nhân viên.  Nếu cô ta hỏi lại và có vẻ hứng thú với đề tài này, anh ta có thể tạm an tâm rằng cô ta không lấy trộm, còn nếu cô ta đột nhiên trở nên không thoải mái và tìm cách thay đổi đề tài thì rõ ràng cô ta có động cơ không trong sáng.  Người giám đốc khi đó sẽ nhận ra sự chuyển hướng đột ngột trong thái độ và hành vi của người nhân viên. Nếu cô gái đó hoàn toàn trong sạch, có lẽ cô ta sẽ đưa ra hướng giải quyết của mình và vui vẻ khi sếp hỏi ý kiến của mình. Ngược lại, cô ta sẽ có biểu hiện không thoải mái rõ ràng và có lẽ sẽ cố cam đoan với sếp rằng cô không đời nào làm việc như vậy. Không có lí do gì để cô ta phải thanh minh như vậy, trừ phi cô là người có cảm giác tội lỗi…",
      "author": "TS David J Lieberman",
      "category": "",
      "price": "89000",
      "status": true,
      "id": 2,
      "sale": "71200"
    },
    {
      "name": "Không Diệt Không Sinh Đừng Sợ Hãi (Tái Bản 2022)",
      "img": "https://cdn0.fahasa.com/media/catalog/product/8/9/8935278607311.jpg",
      "description": "Nhiều người trong chúng ta tin rằng cuộc đời của ta bắt đầu từ lúc chào đời và kết thúc khi ta chết. Chúng ta tin rằng chúng ta tới từ cái Không, nên khi chết chúng ta cũng không còn lại gì hết. Và chúng ta lo lắng vì sẽ trở thành hư vô.  Bụt có cái hiểu rất khác về cuộc đời. Ngài hiểu rằng sống và chết chỉ là những ý niệm không có thực. Coi đó là sự thực, chính là nguyên do gây cho chúng ta khổ não. Bụt dạy không có sinh, không có diệt, không tới cũng không đi, không giống nhau cũng không khác nhau, không có cái ngã thường hằng cũng không có hư vô. Chúng ta thì coi là Có hết mọi thứ. Khi chúng ta hiểu rằng mình không bị hủy diệt thì chúng ta không còn lo sợ. Đó là sự giải thoát. Chúng ta có thể an hưởng và thưởng thức đời sống một cách mới mẻ.  Không diệt Không sinh Đừng sợ hãi là tựa sách được Thiền sư Thích Nhất Hạnh viết nên dựa trên kinh nghiệm của chính mình. Ở đó, Thầy Nhất Hạnh đã đưa ra một thay thế đáng ngạc nhiên cho hai triết lý trái ngược nhau về vĩnh cửu và hư không: “Tự muôn đời tôi vẫn tự do. Tử sinh chỉ là cửa ngõ ra vào, tử sinh là trò chơi cút bắt. Tôi chưa bao giờ từng sinh cũng chưa bao giờ từng diệt” và “Nỗi khổ lớn nhất của chúng ta là ý niệm về đến-đi, lui-tới.”  Được lặp đi lặp lại nhiều lần, Thầy khuyên chúng ta thực tập nhìn sâu để chúng ta hiểu được và tự mình nếm được sự tự do của con đường chính giữa, không bị kẹt vào cả hai ý niệm của vĩnh cửu và hư không. Là một thi sĩ nên khi giải thích về các sự trái ngược trong đời sống, Thầy đã nhẹ nhàng vén bức màn vô minh ảo tưởng dùm chúng ta, cho phép chúng ta (có lẽ lần đầu tiên trong đời) được biết rằng sự kinh hoàng về cái chết chỉ có nguyên nhân là các ý niệm và hiểu biết sai lầm của chính mình mà thôi.  Tri kiến về sống, chết của Thầy vô cùng vi tế và đẹp đẽ. Cũng như những điều vi tế, đẹp đẽ khác, cách thưởng thức hay nhất là thiền quán trong thinh lặng. Lòng nhân hậu và từ bi phát xuất từ suối nguồn thâm tuệ của Thiền sư Thích Nhất Hạnh là một loại thuốc chữa lành những vết thương trong trái tim chúng ta.  Mã hàng\t8935278607311 Tên Nhà Cung Cấp\tSaigon Books Tác giả\tThích Nhất Hạnh NXB\tThế Giới Năm XB\t2022 Trọng lượng (gr)\t250 Kích Thước Bao Bì\t20.5 x 13 cm x 1.2 Số trang\t224 Hình thức\tBìa Mềm Sản phẩm hiển thị trong\t Sách Sắp Phát Hành Saigon Books Sản phẩm bán chạy nhất\tTop 100 sản phẩm Tôn Giáo bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Nhiều người trong chúng ta tin rằng cuộc đời của ta bắt đầu từ lúc chào đời và kết thúc khi ta chết. Chúng ta tin rằng chúng ta tới từ cái Không, nên khi chết chúng ta cũng không còn lại gì hết. Và chúng ta lo lắng vì sẽ trở thành hư vô.  Bụt có cái hiểu rất khác về cuộc đời. Ngài hiểu rằng sống và chết chỉ là những ý niệm không có thực. Coi đó là sự thực, chính là nguyên do gây cho chúng ta khổ não. Bụt dạy không có sinh, không có diệt, không tới cũng không đi, không giống nhau cũng không khác nhau, không có cái ngã thường hằng cũng không có hư vô. Chúng ta thì coi là Có hết mọi thứ. Khi chúng ta hiểu rằng mình không bị hủy diệt thì chúng ta không còn lo sợ. Đó là sự giải thoát. Chúng ta có thể an hưởng và thưởng thức đời sống một cách mới mẻ.  Không diệt Không sinh Đừng sợ hãi là tựa sách được Thiền sư Thích Nhất Hạnh viết nên dựa trên kinh nghiệm của chính mình. Ở đó, Thầy Nhất Hạnh đã đưa ra một thay thế đáng ngạc nhiên cho hai triết lý trái ngược nhau về vĩnh cửu và hư không: “Tự muôn đời tôi vẫn tự do. Tử sinh chỉ là cửa ngõ ra vào, tử sinh là trò chơi cút bắt. Tôi chưa bao giờ từng sinh cũng chưa bao giờ từng diệt” và “Nỗi khổ lớn nhất của chúng ta là ý niệm về đến-đi, lui-tới.”  Được lặp đi lặp lại nhiều lần, Thầy khuyên chúng ta thực tập nhìn sâu để chúng ta hiểu được và tự mình nếm được sự tự do của con đường chính giữa, không bị kẹt vào cả hai ý niệm của vĩnh cửu và hư không. Là một thi sĩ nên khi giải thích về các sự trái ngược trong đời sống, Thầy đã nhẹ nhàng vén bức màn vô minh ảo tưởng dùm chúng ta, cho phép chúng ta (có lẽ lần đầu tiên trong đời) được biết rằng sự kinh hoàng về cái chết chỉ có nguyên nhân là các ý niệm và hiểu biết sai lầm của chính mình mà thôi.  Tri kiến về sống, chết của Thầy vô cùng vi tế và đẹp đẽ. Cũng như những điều vi tế, đẹp đẽ khác, cách thưởng thức hay nhất là thiền quán trong thinh lặng. Lòng nhân hậu và từ bi phát xuất từ suối nguồn thâm tuệ của Thiền sư Thích Nhất Hạnh là một loại thuốc chữa lành những vết thương trong trái tim chúng ta.",
      "author": "Thích Nhất Hạnh",
      "category": "",
      "price": "110000",
      "status": true,
      "id": 3,
      "sale": "88000"
    },
    {
      "name": "Muôn Kiếp Nhân Sinh - Many Times, Many Lives",
      "img": "https://cdn0.fahasa.com/media/catalog/product/m/u/muonkiepnhansinh.jpg",
      "description": "Muôn Kiếp Nhân Sinh - Many Times, Many Lives  Giáo sư John Vũ – Nguyên Phong và những câu chuyện chưa từng có về tiền kiếp, khám phá luật Nhân quả, Luân hồi.  “Muôn kiếp nhân sinh” là tác phẩm do Giáo sư John Vũ - Nguyên Phong viết từ năm 2017 và hoàn tất đầu năm 2020 ghi lại những câu chuyện, trải nghiệm tiền kiếp kỳ lạ từ nhiều kiếp sống của người bạn tâm giao lâu năm, ông Thomas – một nhà kinh doanh tài chính nổi tiếng ở New York. Những câu chuyện chưa từng tiết lộ này sẽ giúp mọi người trên thế giới chiêm nghiệm, khám phá các quy luật về luật Nhân quả và Luân hồi của vũ trụ giữa lúc trái đất đang gặp nhiều tai ương, biến động, khủng hoảng từng ngày.  “Muôn kiếp nhân sinh” là một bức tranh lớn với vô vàn mảnh ghép cuộc đời, là một cuốn phim đồ sộ, sống động về những kiếp sống huyền bí, trải dài từ nền văn minh Atlantis hùng mạnh đến vương quốc Ai Cập cổ đại của các Pharaoh quyền uy, đến Hợp Chủng Quốc Hoa Kỳ ngày nay.  “Muôn kiếp nhân sinh”cung cấp cho bạn đọc kiến thức mới mẻ, vô tận của nhân loại lần đầu được hé mở, cùng những phân tích uyên bác, tiên đoán bất ngờ về hiện tại và tương lai thế giới của những bậc hiền triết thông thái. Đời người tưởng chừng rất dài nhưng lại trôi qua rất nhanh, sinh vượng suy tử, mong manh như sóng nước. Luật nhân quả cực kỳ chính xác, chi tiết, phức tạp được thu thập qua nhiều đời, nhiều kiếp, liên hệ tương hỗ đan xen chặt chữ lẫn nhau, không ai có thể tính được tích đức này có thể trừ được nghiệp kia không, không ai có thể biết được khi nào nhân sẽ trổ quả. Nhưng, một khi đã gây ra nhân thì chắc chắn sẽ gặt quả - luật Nhân quả của vũ trụ trước giờ không bao giờ sai.  Luật Luân hồi và Nhân quả đã tạo nhân duyên để người này gặp người kia. Gặp nhau có khi là duyên, có khi là nợ; gặp nhau có lúc để trả nợ, có lúc để nối lại duyên xưa. Có biết bao việc diễn ra trong đời, tưởng chừng như là ngẫu nhiên nhưng thật ra đã được sắp đặt từ trước. Luân hồi là một ngôi trường rộng lớn, nơi tất cả con người, tất cả sinh vật đều phải học bài học của riêng mình cho đến khi thật hoàn thiện mới thôi. Nếu không chịu học hay chưa học được trọn vẹn thì buộc phải học lại, chính xác theo quy luật của Nhân quả.  Thomas đã chia sẻ vì sao đã kể những câu chuyện riêng tư huyền bí này với Giáo sư John Vũ để thực hiện tác phẩm “Muôn kiếp nhân sinh”:   “Hiện nay thế giới đang trải qua giai đoạn hỗn loạn, xáo trộn, mà thật ra thì mọi quốc gia đều đang gánh chịu những nghiệp quả mà họ đã gây ra trong quá khứ. Mỗi quốc gia, cũng như mọi cá nhân, đều có những nghiệp quả riêng do những nhân mà họ đã gây ra. Cá nhân thì có ‘biệt nghiệp‘ riêng của từng người, nhưng quốc gia thì có ‘cộng nghiệp‘ mà tất cả những người sống trong đó đều phải trả.  Thường thì con người, khi hành động, ít ai nghĩ đến hậu quả, nhưng một khi hậu quả xảy đến thì họ nghĩ gì, làm gì? Họ oán hận, trách trời, trách đất, trách những người chung quanh đã gây ra những hậu quả đó? Có mấy ai biết chiêm nghiệm, tự trách mình và thay đổi không?  Tôi mong chúng ta - những cánh bướm bé nhỏ rung động mong manh cũng có thể tạo nên những trận cuồng phong mãnh liệt để thức tỉnh mọi người.  Tương lai của mỗi con người, mỗi tổ chức, mỗi quốc gia và cả hành tinh này sẽ ra sao trong giai đoạn sắp tới là tùy thuộc vào thái độ ứng xử, nhìn nhận và thức tỉnh của từng cá nhân, từng tổ chức, từng quốc gia đó tạo nên. Nếu muốn thay đổi, cần khởi đầu bằng việc nhận thức, chuyển đổi tâm thức, lan tỏa yêu thương và chia sẻ sự hiểu biết từ mỗi người chúng ta trước.  Nhân quả đừng đợi thấy mới tin.  Nhân quả là bảng chỉ đường, giúp con người tìm về thiện lương“  Cuốn sách được xuất bản bằng tiếng Việt trước khi được chuyển nhượng bản quyền cho các quốc gia khác trên thế giới.  Về tác giả  Tác giả Nguyên Phong (Vũ Văn Du) du học ở Mỹ từ năm 1968, tốt nghiệp cao học Sinh vật học, Điện toán. Ông từng là Kỹ sư trưởng, CIO của Tập đoàn Boeing của Mỹ, Viện trưởng Viện Công nghệ Sinh học Đại học Carnegie Mellon. Ông được mọi người biết tới là Giáo sư John Vu – Nhà khoa học uy tín về công nghệ thông tin. , CMMI và từng giảng dạy ở nhiều trường đại học trên thế giới.   Nguyên Phong là bút danh của bộ sách văn hóa tâm linh được dịch, viết phóng tác từ trải nghiệm, tiềm thức và quá trình nghiên cứu, khám phá các giá trị tinh thần Đông phương. Ông đã viết phóng tác tác phẩm bất hủ Hành trình về Phương Đông năm 24 tuổi (1974). Các tác phẩm khác của Nguyên Phong được bạn đọc nhiều thế hệ yêu thích: Ngọc sáng trong hoa sen, Bên rặng tuyết sơn, Hoa sen trên tuyết, Hoa trôi trên sóng nước, Huyền thuật và các đạo sĩ Tây Tạng, Trở về từ xứ tuyết, Trở về từ cõi sáng, Minh triết trong đời sống, Đường mây qua xứ tuyết, Dấu chân trên cát, Đường mây trong cõi mộng, Đường mây trên đất hoa… và bộ sách dành cho sinh viên, thầy cô: Khởi hành, Kết nối, Bước ra thế giới, Kiến tạo thế hệ Việt Nam ưu việt, GS John Vu và lời khuyên dành cho thầy cô, GS John Vu và lời khuyên dành cho các bậc cha mẹ.  Mã hàng\t8935086851760 Tên Nhà Cung Cấp\tFIRST NEWS Tác giả\tNguyên Phong NXB\tNXB Tổng Hợp TPHCM Năm XB\t2020 Ngôn Ngữ\tTiếng Việt Trọng lượng (gr)\t450 Kích Thước Bao Bì\t20.5 x 14 cm Số trang\t408 Hình thức\tBìa Mềm Sản phẩm hiển thị trong\t FIRST NEWS Sản phẩm bán chạy nhất\tTop 100 sản phẩm Tôn Giáo bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Muôn Kiếp Nhân Sinh - Many Times, Many Lives  Giáo sư John Vũ – Nguyên Phong và những câu chuyện chưa từng có về tiền kiếp, khám phá luật Nhân quả, Luân hồi.  “Muôn kiếp nhân sinh” là tác phẩm do Giáo sư John Vũ - Nguyên Phong viết từ năm 2017 và hoàn tất đầu năm 2020 ghi lại những câu chuyện, trải nghiệm tiền kiếp kỳ lạ từ nhiều kiếp sống của người bạn tâm giao lâu năm, ông Thomas – một nhà kinh doanh tài chính nổi tiếng ở New York. Những câu chuyện chưa từng tiết lộ này sẽ giúp mọi người trên thế giới chiêm nghiệm, khám phá các quy luật về luật Nhân quả và Luân hồi của vũ trụ giữa lúc trái đất đang gặp nhiều tai ương, biến động, khủng hoảng từng ngày.  “Muôn kiếp nhân sinh” là một bức tranh lớn với vô vàn mảnh ghép cuộc đời, là một cuốn phim đồ sộ, sống động về những kiếp sống huyền bí, trải dài từ nền văn minh Atlantis hùng mạnh đến vương quốc Ai Cập cổ đại của các Pharaoh quyền uy, đến Hợp Chủng Quốc Hoa Kỳ ngày nay.  “Muôn kiếp nhân sinh”cung cấp cho bạn đọc kiến thức mới mẻ, vô tận của nhân loại lần đầu được hé mở, cùng những phân tích uyên bác, tiên đoán bất ngờ về hiện tại và tương lai thế giới của những bậc hiền triết thông thái. Đời người tưởng chừng rất dài nhưng lại trôi qua rất nhanh, sinh vượng suy tử, mong manh như sóng nước. Luật nhân quả cực kỳ chính xác, chi tiết, phức tạp được thu thập qua nhiều đời, nhiều kiếp, liên hệ tương hỗ đan xen chặt chữ lẫn nhau, không ai có thể tính được tích đức này có thể trừ được nghiệp kia không, không ai có thể biết được khi nào nhân sẽ trổ quả. Nhưng, một khi đã gây ra nhân thì chắc chắn sẽ gặt quả - luật Nhân quả của vũ trụ trước giờ không bao giờ sai.  Luật Luân hồi và Nhân quả đã tạo nhân duyên để người này gặp người kia. Gặp nhau có khi là duyên, có khi là nợ; gặp nhau có lúc để trả nợ, có lúc để nối lại duyên xưa. Có biết bao việc diễn ra trong đời, tưởng chừng như là ngẫu nhiên nhưng thật ra đã được sắp đặt từ trước. Luân hồi là một ngôi trường rộng lớn, nơi tất cả con người, tất cả sinh vật đều phải học bài học của riêng mình cho đến khi thật hoàn thiện mới thôi. Nếu không chịu học hay chưa học được trọn vẹn thì buộc phải học lại, chính xác theo quy luật của Nhân quả.  Thomas đã chia sẻ vì sao đã kể những câu chuyện riêng tư huyền bí này với Giáo sư John Vũ để thực hiện tác phẩm “Muôn kiếp nhân sinh”:   “Hiện nay thế giới đang trải qua giai đoạn hỗn loạn, xáo trộn, mà thật ra thì mọi quốc gia đều đang gánh chịu những nghiệp quả mà họ đã gây ra trong quá khứ. Mỗi quốc gia, cũng như mọi cá nhân, đều có những nghiệp quả riêng do những nhân mà họ đã gây ra. Cá nhân thì có ‘biệt nghiệp‘ riêng của từng người, nhưng quốc gia thì có ‘cộng nghiệp‘ mà tất cả những người sống trong đó đều phải trả.  Thường thì con người, khi hành động, ít ai nghĩ đến hậu quả, nhưng một khi hậu quả xảy đến thì họ nghĩ gì, làm gì? Họ oán hận, trách trời, trách đất, trách những người chung quanh đã gây ra những hậu quả đó? Có mấy ai biết chiêm nghiệm, tự trách mình và thay đổi không?  Tôi mong chúng ta - những cánh bướm bé nhỏ rung động mong manh cũng có thể tạo nên những trận cuồng phong mãnh liệt để thức tỉnh mọi người.  Tương lai của mỗi con người, mỗi tổ chức, mỗi quốc gia và cả hành tinh này sẽ ra sao trong giai đoạn sắp tới là tùy thuộc vào thái độ ứng xử, nhìn nhận và thức tỉnh của từng cá nhân, từng tổ chức, từng quốc gia đó tạo nên. Nếu muốn thay đổi, cần khởi đầu bằng việc nhận thức, chuyển đổi tâm thức, lan tỏa yêu thương và chia sẻ sự hiểu biết từ mỗi người chúng ta trước.  Nhân quả đừng đợi thấy mới tin.  Nhân quả là bảng chỉ đường, giúp con người tìm về thiện lương“  Cuốn sách được xuất bản bằng tiếng Việt trước khi được chuyển nhượng bản quyền cho các quốc gia khác trên thế giới.  Về tác giả  Tác giả Nguyên Phong (Vũ Văn Du) du học ở Mỹ từ năm 1968, tốt nghiệp cao học Sinh vật học, Điện toán. Ông từng là Kỹ sư trưởng, CIO của Tập đoàn Boeing của Mỹ, Viện trưởng Viện Công nghệ Sinh học Đại học Carnegie Mellon. Ông được mọi người biết tới là Giáo sư John Vu – Nhà khoa học uy tín về công nghệ thông tin. , CMMI và từng giảng dạy ở nhiều trường đại học trên thế giới.   Nguyên Phong là bút danh của bộ sách văn hóa tâm linh được dịch, viết phóng tác từ trải nghiệm, tiềm thức và quá trình nghiên cứu, khám phá các giá trị tinh thần Đông phương. Ông đã viết phóng tác tác phẩm bất hủ Hành trình về Phương Đông năm 24 tuổi (1974). Các tác phẩm khác của Nguyên Phong được bạn đọc nhiều thế hệ yêu thích: Ngọc sáng trong hoa sen, Bên rặng tuyết sơn, Hoa sen trên tuyết, Hoa trôi trên sóng nước, Huyền thuật và các đạo sĩ Tây Tạng, Trở về từ xứ tuyết, Trở về từ cõi sáng, Minh triết trong đời sống, Đường mây qua xứ tuyết, Dấu chân trên cát, Đường mây trong cõi mộng, Đường mây trên đất hoa… và bộ sách dành cho sinh viên, thầy cô: Khởi hành, Kết nối, Bước ra thế giới, Kiến tạo thế hệ Việt Nam ưu việt, GS John Vu và lời khuyên dành cho thầy cô, GS John Vu và lời khuyên dành cho các bậc cha mẹ.",
      "author": "Nguyên Phong",
      "category": "",
      "price": "168000",
      "status": true,
      "id": 4,
      "sale": "100800"
    },
    {
      "name": "Thay Đổi Cuộc Sống Với Nhân Số Học",
      "img": "https://cdn0.fahasa.com/media/catalog/product/t/d/tdcsvnsh.jpg",
      "description": "Thay Đổi Cuộc Sống Với Nhân Số Học  Cuốn sách Thay đổi cuộc sống với Nhân số học là tác phẩm được chị Lê Đỗ Quỳnh Hương phát triển từ tác phẩm gốc “The Complete Book of Numerology” của tiến sỹ David A. Phillips, khiến bộ môn Nhân số học khởi nguồn từ nhà toán học Pythagoras trở nên gần gũi, dễ hiểu hơn với độc giả Việt Nam.  Đầu năm 2020, chuỗi chương trình “Thay đổi cuộc sống với Nhân số học” của  biên tập viên, người dẫn chương trình quen thuộc tại Việt Nam Lê Đỗ Quỳnh Hương ra đời trên Youtube, với mục đích chia sẻ kiến thức, giúp mọi người tìm hiểu và phát triển, hoàn thiện bản thân, các mối quan hệ xã hội thông qua bộ môn Nhân số học. Chương trình đã nhận được sự yêu mến và phản hồi tích cực của rất nhiều khán giả và độc giả sau mỗi tập phát sóng.  Nhân số học là một môn nghiên cứu sự tương quan giữa những con số trong ngày sinh, cái tên với cuộc sống, vận mệnh, đường đời và tính cách của mỗi người. Bộ môn này đã được nhà toán học Pythagoras khởi xướng cách đây 2.600 năm và sau này được nhiều thế hệ học trò liên tục kế thừa, phát triển.     Có thể xem, Nhân số học là một bộ môn Khám phá Bản thân (Self-Discovery), đọc vị về số. Bộ môn này giúp giải mã những tín hiệu mà cuộc sống đã gửi đến từng cá thể con người trong đời sống, tương tự như Nhân tướng học hay Nhân trắc học…Khi nghiêm túc nghiên cứu sự tồn tại và mối tương quan giữa các con số xuất hiện trong ngày, tháng, năm sinh của mỗi người qua Nhân số học, ta có thể hiểu được khá nhiều về bản thân mình, cũng như mối quan hệ của mình với người khác. Nếu hiểu những \"mật mã\" nằm ẩn dưới những con số, chúng ta có thể kiểm soát cuộc sống của mình, điều chỉnh chúng theo hướng ngày càng tốt đẹp hơn, phù hợp với năng lực, tính cách của mình hơn.  Trong quyển sách “Thay đổi cuộc sống với Nhân số học”, Lê Đỗ Quỳnh Hương đã sử dụng khoảng 60% nền tảng tri thức từ quyển sách “The Complete Book of Numerology” (tạm dịch: Một quyển sách toàn diện về Nhân số học) của Tiến sĩ David A. Phillips (1934 – 1993) và 40% kết quả nghiên cứu của chị sau khi phân tích hơn 500 trường hợp cụ thể của những người Việt Nam sinh ra trong thế kỷ 21.   Cuốn sách “Thay đổi cuộc sống với Nhân số học”mang lại đầy đủ những kiến thức quan trọng nhất mà người hứng thú với Nhân số học cần tìm hiểu. Sách bao gồm các kiến thức về ba thể trong một con người, con số chủ đạo, biểu đồ ngày sinh, các mũi tên chỉ đặc điểm, con số ngày sinh, chu kỳ 9 năm, ba giai đoạn và bốn đỉnh cao của đời người cùng ý nghĩa, sức mạnh của cái tên của mỗi người. Các kiến thức này được diễn giải, phân tích và đi kèm các ví dụ cụ thể.  Với mục đích đem Nhân số học trở nên gần gũi, dễ ứng dụng và mang lại những giá trị tích cực cho mỗi người trong đời sống, chị Lê Đỗ Quỳnh Hương mong rằng trong hành trình khám phá bản thân qua những con số, người đọc có thể hiểu về mình - hiểu được những thuận lợi và bất lợi mà mình gặp phải, từ đó tìm được động lực lớn để thay đổi cuộc sống. Giá trị của cuốn sách “Thay đổi cuộc sống với Nhân số học” nằm ở kiến thức tổng quan về Nhân số học và những lời khuyên sâu sắc để mỗi người có thể chuyển mình theo những hướng tích cực hơn như sống có lý tưởng, mở lòng, chăm chỉ, biết lắng nghe người khác, luyện tập thiền định, tập trung, sống có trách nhiệm, biết ơn và yêu thương…  Trong cuộc đời của mỗi con người, chúng ta thường phải mày mò, tìm kiếm con đường riêng cho mình mà không biết chắc con đường đó có phù hợp với mình hay không. Đôi lúc, chúng ta phải phải trầy trật, vấp ngã thậm chí lạc lối mới rút ra được kinh nghiệm, bài học. Nếu hiểu về Nhân số học, và thông qua những kiến thức nhất định về ý nghĩa và sự kết hợp của các con số, chúng ta có thể tự vạch ra cho mình một hướng đi tương đối cụ thể, giảm thiểu được các lần “thử và sai”, từ đó tìm được nhiều niềm vui, hạnh phúc, ý nghĩa trong cuộc sống.  Đó chính là thông điệp và mục đích lớn nhất mà tiến sỹ David A. Phillips và Lê Đỗ Quỳnh Hương mong muốn gửi gắm cho đông đảo bạn đọc.  VỀ TÁC GIẢ  DAVID A. PHILLIPS, tiến sĩ triết học tại Đại học London năm 1971, nhưng sau đó lại được biết đến như một chuyên gia trong lĩnh vực sức khỏe và dinh dưỡng. Lúc sinh thời, ông cũng thường đến các nước nói tiếng Anh trên thế giới để giảng dạy và diễn thuyết, tư vấn về Nhân số học, cống hiến sự nghiên cứu cả đời mình về lĩnh vực sức khỏe và phát triển cá nhân cho việc giảng dạy.Tiến sĩ A.Phillips viết tổng cộng 12 quyển sách, trong đó, nổi tiếng và được yêu thích rộng rãi nhất là cuốn The Complete Book of Numerology (Một quyển sách toàn diện về Nhân Số Học).  Lê Đỗ Quỳnh Hương, thạc sĩ Âm nhạc học tại Nhạc viện TP. HCM, là một biên tập viên, người dẫn chương trình quen thuộc tại Việt Nam, cũng là một cây bút với nhiều quyển sách về chủ đề sống tích cực được nhiều người yêu thích. Lần đầu tiên bén duyên với lĩnh vực Nhân số học, chị cùng các đồng sự đã tìm hiểu, nghiên cứu dựa trên nền tảng cuốn “The Complete Book of Numerology” để cho ra đời tác phẩm “Thay đổi cuộc sống với Nhân số học”, một quyển sách giúp bản thân mỗi người hiểu rõ mình hơn và qua đó, có những thay đổi trong cách sống, cách suy nghĩ, hành động... hướng tới cuộc sống vui vẻ, hạnh phúc, an lạc hơn.  NGƯỜI NỔI TIẾNG NÓI GÌ VỀ CUỐN SÁCH  “Từ khi tìm hiểu Nhân số học và biết được con số chủ đạo của mình là số 3, tôi thấy vừa bất ngờ vừa thú vị. Phần nói về tính cách của người có con số chủ đạo 3 quá chính xác, gần như hoàn toàn đúng đối với tôi.”- Ca sĩ Đàm Vĩnh Hưng.  Trước đây, tôi thường oán giận tại sao mình cũng có năng lực nhưng lại không chạm đến được những điều mình mong muốn. Rồi tôi nhận ra do trước đây tôi đã đặt cái tôi của mình quá cao trong mọi chuyện, trải qua nhiều biến cố nhưng vẫn không rút ra được bài học gì cho bản thân. Mãi đến khi biết đến Nhân số học, tôi có cơ hội dám nhìn lại toàn diện bức tranh cuộc đời mình. Khi ý thức được mình là người có nhiều số 1 và số 7 trong Biểu đồ ngày sinh, tôi bắt đầu nhìn nhận sự việc khác đi, nghiệm lại và dần dần tự điều chỉnh bản thân. Và tới bây giờ, tôi đang có một cuộc sống với năng lượng rất tích cực.”- Nhạc sĩ Phương Uyên.  “Trước đây, tôi từng rất dễ bị ảnh hưởng bởi cảm xúc của mọi người xung quanh. Nhưng tôi của bây giờ đã khác. Nhân số học như một công cụ giúp tôi quán chiếu lại cuộc sống của mình, giúp tôi mỗi ngày luôn hướng về những điều tích cực. Cảm ơn chị Quỳnh Hương đã cất công tìm hiểu, cấu trúc lại Nhân số học và lan tỏa giá trị đến mọi người.”- Nhà nhiếp ảnh Tâm Bùi  “Tôi là con trai một, được ba mẹ cưng chiều nên rất ham chơi. Tôi sa vào những cuộc nhậu nhẹt, đàn đúm, cá độ, đánh nhau. Cuộc sống bết bát của tôi đã khiến ba tôi ngày càng phiền muộn, ngay cả vào những ngày cuối đời của ông trên giường bệnh. Nhờ mẹ, tôi biết đến cô Quỳnh Hương và Nhân số học, và nhờ Nhân số học, cuộc sống của tôi bắt đầu thay đổi. Tôi hiểu về ‘mảnh đất’ mà Vũ trụ giao cho tôi, và tôi chọn sống khác đi. Tôi thực hiện thiền biết ơn mỗi ngày, gửi yêu thương đến mọi thứ xung quanh, bắt đầu một công việc mới, theo đúng sứ mệnh của một người có con số chủ đạo 6 và có đỉnh cao số 9. Cảm ơn Nhân số học, cô Quỳnh Hương và mẹ đã gieo duyên cho con. Biết ơn về tất cả!”- Lâm Quang Thịnh - Người được thay đổi nhờ Nhân số học",
      "author": "Lê Đỗ Quỳnh Hương",
      "category": "",
      "price": "248000",
      "status": true,
      "id": 5,
      "sale": "148800"
    },
    {
      "name": "Muôn Kiếp Nhân Sinh - Many Times, Many Lives - Tập 2",
      "img": "https://cdn0.fahasa.com/media/catalog/product/m/u/muonkiepnhansinh2_bia-01.jpg",
      "description": "Hiếm có cuốn sách nào ngay từ khi ra mắt đã tạo nên hiện tượng văn hóa đọc và sau nửa năm đã trở thành cuốn sách bán chạy nhất năm 2020 tại Việt Nam như Muôn Kiếp Nhân Sinh. Cơn sốt của cuốn sách này tiếp tục được dấy lên vào dịp Tết Nguyên Đán 2021 khi công ty First News Trí Việt hé lộ đang “ngày đêm thực hiện Muôn Kiếp Nhân Sinh tập 2”. Đáp lại sự mong đợi của độc giả suốt hơn ba tháng, Muôn Kiếp Nhân Sinh tập 2 đã chính thức phát hành trên cả nước.  Muôn Kiếp Nhân Sinh tập 2 của tác giả Nguyên Phong tiếp tục là những câu chuyện tiền kiếp, nhân quả luân hồi hấp dẫn gắn liền với những kiến giải uyên bác về quá khứ, hiện tại, tương lai của nhân loại và thế giới thông qua góc nhìn của cả khoa học và tâm linh. Chúng ta là ai, chúng ta đến từ đâu và sẽ đi về đâu? Làm cách nào để chữa lành thế giới này, hành tinh này trước những biến cố lớn đang và sẽ diễn ra trong tương lai gần?  Trong tập 2, hành trình thức tỉnh tâm linh của nhân vật Thomas sẽ dẫn dắt người đọc đến với những tầng cõi năng lượng gắn chặt với thế giới hữu hình của con người thông qua sự vận động của nghiệp lực, nhân quả, để giải thích về thứ năng lượng huyền bí luôn biến chuyển trong chu kỳ bất tận của vũ trụ. Không chỉ là trải nghiệm ly kỳ tại tiền kiếp cổ đại ở Assiria, Hy Lạp, độc giả còn được khám phá hành trình của linh hồn đến những tầng cõi – trạm trung chuyển khác nhau, được xâu chuỗi lại bằng cả triết học, tín ngưỡng, lịch sử và khoa học thế giới từ Đông sang Tây, từ cổ đại đến hiện đại. Năng lượng không tự nhiên sinh ra và cũng không tự nhiên mất đi, sự sống này cũng vậy, khởi đầu và kết thúc - tuy hai mà một, và chỉ có nhân quả sẽ luôn tuần hoàn vận hành bất tận.  Muôn Kiếp Nhân Sinh tập 2 lý giải rằng vạn vật trên thế giới như cỏ cây, hoa lá, côn trùng, thú vật và con người tuy bề ngoài có vẻ khác biệt nhưng tinh hoa bên trong vẫn là một, đó là sự sống hay năng lượng khởi thủy uyên nguyên. Tinh hoa đó như là “Nước”, còn vạn vật chỉ là “Sóng”. Sóng thì muôn trùng, sóng lớn, sóng nhỏ… nhưng chúng vẫn chỉ là nước. Nếu chân ngã là đại dương thì bản ngã chỉ là nước chứa đựng trong cái chén. Vấn đề là làm sao phá vỡ cái chén để nước trở về với đại dương và đó cũng chính là hành trình của Thomas từ một doanh nhân với niềm tin duy vật hoàn toàn đã từng bước giác ngộ, thức tỉnh để khám phá về luân hồi, nhân quả, chuyển hóa nghiệp quả, chuyển đổi tâm thức và gửi gắm những thông điệp nhân sinh tốt đẹp đến độc giả.  Tác giả Nguyên Phong chia sẻ trong cuốn sách rằng, mọi việc dù lớn hay nhỏ cũng sẽ góp phần ảnh hưởng trực tiếp đến cuộc sống hiện tại hoặc trong tương lai, thậm chí đến tận kiếp sau. Đó là những nghiệp báo ở kiếp trước cộng nghiệp với hành vi của chúng ta trong kiếp này để hình thành nên bánh xe nghiệp lực khổng lồ phức tạp nhưng lại không bỏ sót bất cứ ai, bất cứ quốc gia nào và không bỏ sót bất cứ hành vi hay tư tưởng nào. Bởi lẽ, chúng ta đều là phần tử của một sự sống vĩ đại thuộc về một năng lượng khởi thuỷ, được sắp đặt khéo léo bởi những định luật trong vũ trụ.  Bằng những câu chuyện thú vị, sâu sắc, liên kết với nhau một cách chặt chẽ, Muôn Kiếp Nhân Sinh tập 2 sẽ đưa độc giả vào cuộc hành trình trên chuyến tàu thời gian từ phố Wall nước Mỹ đến những cuộc chinh phạt của Alexander Đại Đế, bí ẩn lăng mộ Tần Thủy Hoàng, những cõi giới linh hồn, rồi quay ngược lại cuộc sống đời thường mà bất cứ ai cũng thấy có mình ở trong đó. Để cùng suy ngẫm về những giá trị đẹp đẽ của đời sống. Để nắm lấy những thời khắc còn lại của cuộc đời mình và xoay chuyển số phận, nghiệp lực theo chiều hướng tỉnh thức và nhân ái. Và trên hết, đó là cùng chung tay xây dựng một thế giới tốt đẹp trên nền tảng của yêu thương và chữa lành.  “Nếu chúng ta có thể cùng nhauchuyển hoá những tư tưởng thù hận, tham lam, íchkỷ bằng những tư tưởng cao thượng, tốt lành; chuyểnhóa các hành động hận thù, giết chóc bằng tình thươngyêu rộng lớn thì mọi việc có thể thay đổi” – trích Muôn Kiếp Nhân Sinh tập 2.  VỀ TÁC GIẢ:     Tác giả Nguyên Phong (Vũ Văn Du) du học ở Mỹ từ năm 1968, tốt nghiệp cao học Sinh vật học, Điện toán. Ông từng là Kỹ sư trưởng của Tập đoàn Boeing của Mỹ, Viện trưởng Viện Công nghệ Sinh học Đại học Carnegie Mellon. Ông được mọi người biết tới là Giáo sư John Vu – Nhà khoa học uy tín về công nghệ thông tin. , CMMI và từng giảng dạy ở nhiều trường đại học trên thế giới.  Nguyên Phong là bút danh của bộ sách văn hóa tâm linh được dịch, viết phóng tác từ trải nghiệm, tiềm thức và quá trình nghiên cứu, khám phá các giá trị tinh thần Đông phương. Ông đã viết phóng tác tác phẩm bất hủ Hành trình về Phương Đông năm 24 tuổi (1974). Các tác phẩm khác của Nguyên Phong được bạn đọc nhiều thế hệ yêu thích: Ngọc sáng trong hoa sen, Bên rặng tuyết sơn, Hoa sen trên tuyết, Hoa trôi trên sóng nước, Huyền thuật và các đạo sĩ Tây Tạng, Trở về từ xứ tuyết, Trở về từ cõi sáng, Minh triết trong đời sống, Đường mây qua xứ tuyết, Dấu chân trên cát, Đường mây trong cõi mộng, Đường mây trên đất hoa… và bộ sách dành cho sinh viên, thầy cô: Khởi hành, Kết nối, Bước ra thế giới, Kiến tạo thế hệ Việt Nam ưu việt, GS John Vu và lời khuyên dành cho thầy cô, GS John Vu và lời khuyên dành cho các bậc cha mẹ.  Mã hàng\t8935086854532 Tên Nhà Cung Cấp\tFIRST NEWS Tác giả\tNguyên Phong NXB\tNXB Tổng Hợp TPHCM Năm XB\t2021 Ngôn Ngữ\tTiếng Việt Trọng lượng (gr)\t600 Kích Thước Bao Bì\t20.5 x 14.5 x 2.8 Số trang\t544 Hình thức\tBìa Mềm Sản phẩm hiển thị trong\t FIRST NEWS Flashsale Mã Giảm Giá RƯỚC DEAL LINH ĐÌNH VUI ĐÓN TRUNG THU Sản phẩm bán chạy nhất\tTop 100 sản phẩm Tôn Giáo bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Hiếm có cuốn sách nào ngay từ khi ra mắt đã tạo nên hiện tượng văn hóa đọc và sau nửa năm đã trở thành cuốn sách bán chạy nhất năm 2020 tại Việt Nam như Muôn Kiếp Nhân Sinh. Cơn sốt của cuốn sách này tiếp tục được dấy lên vào dịp Tết Nguyên Đán 2021 khi công ty First News Trí Việt hé lộ đang “ngày đêm thực hiện Muôn Kiếp Nhân Sinh tập 2”. Đáp lại sự mong đợi của độc giả suốt hơn ba tháng, Muôn Kiếp Nhân Sinh tập 2 đã chính thức phát hành trên cả nước.  Muôn Kiếp Nhân Sinh tập 2 của tác giả Nguyên Phong tiếp tục là những câu chuyện tiền kiếp, nhân quả luân hồi hấp dẫn gắn liền với những kiến giải uyên bác về quá khứ, hiện tại, tương lai của nhân loại và thế giới thông qua góc nhìn của cả khoa học và tâm linh. Chúng ta là ai, chúng ta đến từ đâu và sẽ đi về đâu? Làm cách nào để chữa lành thế giới này, hành tinh này trước những biến cố lớn đang và sẽ diễn ra trong tương lai gần?  Trong tập 2, hành trình thức tỉnh tâm linh của nhân vật Thomas sẽ dẫn dắt người đọc đến với những tầng cõi năng lượng gắn chặt với thế giới hữu hình của con người thông qua sự vận động của nghiệp lực, nhân quả, để giải thích về thứ năng lượng huyền bí luôn biến chuyển trong chu kỳ bất tận của vũ trụ. Không chỉ là trải nghiệm ly kỳ tại tiền kiếp cổ đại ở Assiria, Hy Lạp, độc giả còn được khám phá hành trình của linh hồn đến những tầng cõi – trạm trung chuyển khác nhau, được xâu chuỗi lại bằng cả triết học, tín ngưỡng, lịch sử và khoa học thế giới từ Đông sang Tây, từ cổ đại đến hiện đại. Năng lượng không tự nhiên sinh ra và cũng không tự nhiên mất đi, sự sống này cũng vậy, khởi đầu và kết thúc - tuy hai mà một, và chỉ có nhân quả sẽ luôn tuần hoàn vận hành bất tận.  Muôn Kiếp Nhân Sinh tập 2 lý giải rằng vạn vật trên thế giới như cỏ cây, hoa lá, côn trùng, thú vật và con người tuy bề ngoài có vẻ khác biệt nhưng tinh hoa bên trong vẫn là một, đó là sự sống hay năng lượng khởi thủy uyên nguyên. Tinh hoa đó như là “Nước”, còn vạn vật chỉ là “Sóng”. Sóng thì muôn trùng, sóng lớn, sóng nhỏ… nhưng chúng vẫn chỉ là nước. Nếu chân ngã là đại dương thì bản ngã chỉ là nước chứa đựng trong cái chén. Vấn đề là làm sao phá vỡ cái chén để nước trở về với đại dương và đó cũng chính là hành trình của Thomas từ một doanh nhân với niềm tin duy vật hoàn toàn đã từng bước giác ngộ, thức tỉnh để khám phá về luân hồi, nhân quả, chuyển hóa nghiệp quả, chuyển đổi tâm thức và gửi gắm những thông điệp nhân sinh tốt đẹp đến độc giả.  Tác giả Nguyên Phong chia sẻ trong cuốn sách rằng, mọi việc dù lớn hay nhỏ cũng sẽ góp phần ảnh hưởng trực tiếp đến cuộc sống hiện tại hoặc trong tương lai, thậm chí đến tận kiếp sau. Đó là những nghiệp báo ở kiếp trước cộng nghiệp với hành vi của chúng ta trong kiếp này để hình thành nên bánh xe nghiệp lực khổng lồ phức tạp nhưng lại không bỏ sót bất cứ ai, bất cứ quốc gia nào và không bỏ sót bất cứ hành vi hay tư tưởng nào. Bởi lẽ, chúng ta đều là phần tử của một sự sống vĩ đại thuộc về một năng lượng khởi thuỷ, được sắp đặt khéo léo bởi những định luật trong vũ trụ.  Bằng những câu chuyện thú vị, sâu sắc, liên kết với nhau một cách chặt chẽ, Muôn Kiếp Nhân Sinh tập 2 sẽ đưa độc giả vào cuộc hành trình trên chuyến tàu thời gian từ phố Wall nước Mỹ đến những cuộc chinh phạt của Alexander Đại Đế, bí ẩn lăng mộ Tần Thủy Hoàng, những cõi giới linh hồn, rồi quay ngược lại cuộc sống đời thường mà bất cứ ai cũng thấy có mình ở trong đó. Để cùng suy ngẫm về những giá trị đẹp đẽ của đời sống. Để nắm lấy những thời khắc còn lại của cuộc đời mình và xoay chuyển số phận, nghiệp lực theo chiều hướng tỉnh thức và nhân ái. Và trên hết, đó là cùng chung tay xây dựng một thế giới tốt đẹp trên nền tảng của yêu thương và chữa lành.  “Nếu chúng ta có thể cùng nhauchuyển hoá những tư tưởng thù hận, tham lam, íchkỷ bằng những tư tưởng cao thượng, tốt lành; chuyểnhóa các hành động hận thù, giết chóc bằng tình thươngyêu rộng lớn thì mọi việc có thể thay đổi” – trích Muôn Kiếp Nhân Sinh tập 2.  VỀ TÁC GIẢ:     Tác giả Nguyên Phong (Vũ Văn Du) du học ở Mỹ từ năm 1968, tốt nghiệp cao học Sinh vật học, Điện toán. Ông từng là Kỹ sư trưởng của Tập đoàn Boeing của Mỹ, Viện trưởng Viện Công nghệ Sinh học Đại học Carnegie Mellon. Ông được mọi người biết tới là Giáo sư John Vu – Nhà khoa học uy tín về công nghệ thông tin. , CMMI và từng giảng dạy ở nhiều trường đại học trên thế giới.  Nguyên Phong là bút danh của bộ sách văn hóa tâm linh được dịch, viết phóng tác từ trải nghiệm, tiềm thức và quá trình nghiên cứu, khám phá các giá trị tinh thần Đông phương. Ông đã viết phóng tác tác phẩm bất hủ Hành trình về Phương Đông năm 24 tuổi (1974). Các tác phẩm khác của Nguyên Phong được bạn đọc nhiều thế hệ yêu thích: Ngọc sáng trong hoa sen, Bên rặng tuyết sơn, Hoa sen trên tuyết, Hoa trôi trên sóng nước, Huyền thuật và các đạo sĩ Tây Tạng, Trở về từ xứ tuyết, Trở về từ cõi sáng, Minh triết trong đời sống, Đường mây qua xứ tuyết, Dấu chân trên cát, Đường mây trong cõi mộng, Đường mây trên đất hoa… và bộ sách dành cho sinh viên, thầy cô: Khởi hành, Kết nối, Bước ra thế giới, Kiến tạo thế hệ Việt Nam ưu việt, GS John Vu và lời khuyên dành cho thầy cô, GS John Vu và lời khuyên dành cho các bậc cha mẹ.",
      "author": "Nguyên Phong",
      "category": "",
      "price": "268000",
      "sale": "214400",
      "status": true,
      "id": 6
    }
  ],
  "posts": [
    {
      "id": 1,
      "name": "48 Nguyên Tắc Chủ Chốt Của Quyền Lực (Tái Bản 2020)",
      "img": "https://cdn0.fahasa.com/media/catalog/product/i/m/image_195509_1_32101.jpg",
      "desc": "Quyền lực có sức hấp dẫn vô cùng mạnh mẽ đối với con người trong mọi thời, ở mọi nơi ..."
    },
    {
      "id": 2,
      "name": "Những Quy Luật Của Bản Chất Con Người",
      "img": "https://cdn0.fahasa.com/media/catalog/product/i/m/image_195509_1_38609.jpg",
      "desc": "Robert Greene, tác giả rất được ưa chuộng do New York Times bình chọn của các tác phẩm 48 nguyên tắc chủ chốt của quyền lực; ..."
    },
    {
      "id": 3,
      "name": "Làm Chủ - Mastery",
      "img": "https://cdn0.fahasa.com/media/catalog/product/n/x/nxbtre_full_13012020_030128.jpg",
      "desc": "Cuốn sách này sẽ cho bạn thấy cần làm thế nào để tiếp tục quá trình học hỏi ..."
    }
  ],
  "users": [
    {
      "email": "admin@gmail.com",
      "password": "$2a$10$.NPqde.Sxokh4kvaF8zAD.zUzHAgdcHijZJsZy8pcQuEam8yV38BW",
      "username": "admin",
      "role": 1,
      "id": 1
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Happy Trade",
      "img": "https://scontent.xx.fbcdn.net/v/t1.15752-9/287044886_3284569565158655_2964744814067876534_n.png?stp=dst-png_s640x640&_nc_cat=102&ccb=1-7&_nc_sid=aee45a&_nc_ohc=tk9aSDsmW-YAX9qs9t8&_nc_ad=z-m&_nc_cid=0&_nc_ht=scontent.xx&oh=03_AVKfn-P6LLvhFliXHXdQj1c2lzbFBIJ0820EVvkiaUPPNQ&oe=62CD1C42",
      "year": "2020",
      "category": "Dashboard",
      "desc": "Amet minim mollit non deserunt ullamco est sit aliqua dolor do amet sint. Velit officia consequat duis enim velit mollit. Exercitation veniam consequat sunt nostrud amet."
    },
    {
      "id": 2,
      "title": "Portfolio",
      "img": "https://scontent.xx.fbcdn.net/v/t1.15752-9/285306640_365955078994552_4088306939285821609_n.png?stp=dst-png_p403x403&_nc_cat=104&ccb=1-7&_nc_sid=aee45a&_nc_ohc=D5kxbgxpUZoAX-Xa1OO&_nc_ad=z-m&_nc_cid=0&_nc_ht=scontent.xx&oh=03_AVJggoNVxX1sAnCwS0fVY4psP7GwJabj1ebCjrcEjJjTzQ&oe=62CEF757",
      "year": "2018",
      "category": "Illustration",
      "desc": "Amet minim mollit non deserunt ullamco est sit aliqua dolor do amet sint. Velit officia consequat duis enim velit mollit. Exercitation veniam consequat sunt nostrud amet."
    },
    {
      "id": 3,
      "title": "Mona Watch",
      "img": "https://scontent.xx.fbcdn.net/v/t1.15752-9/287694642_1372757269870546_1474137581777902779_n.png?stp=dst-png_p403x403&_nc_cat=109&ccb=1-7&_nc_sid=aee45a&_nc_ohc=Ao7k-qNadR8AX-P91BV&_nc_ad=z-m&_nc_cid=0&_nc_ht=scontent.xx&oh=03_AVIS1tmTzulodAscmA85sUjUIHjv8VBM-m8-pqTDPXpZgA&oe=62CF6C48",
      "year": "2018",
      "category": "Typography",
      "desc": "Amet minim mollit non deserunt ullamco est sit aliqua dolor do amet sint. Velit officia consequat duis enim velit mollit. Exercitation veniam consequat sunt nostrud amet."
    }
  ],
  "blogs": [
    {
      "id": 1,
      "title": "Let’s Create a Tiny Programming Language",
      "subTitle": "DigitalOcean joining forces with CSS-Tricks! Special welcome offer: get $100 of free credit.",
      "content": "<p>By now, you are probably familiar with one or more programming languages. <strong>But have you ever wondered how you could create your own programming language?</strong> And by that, I mean:</p><blockquote><p><i>A programming language is any set of rules that convert strings to various kinds of machine code output.</i></p></blockquote><p>In short, a programming language is just a set of predefined rules. And to make them useful, you need something that understands those rules. And those things are <i>compilers</i>, <i>interpreters</i>, etc. So we can simply define some rules, then, to make it work, we can use any existing programming language to make a program that can understand those rules, which will be our interpreter.</p><h3><strong>Compiler</strong></h3><p>A compiler converts codes into machine code that the processor can execute (e.g. C++ compiler).</p><h3><strong>Interpreter</strong></h3><p>An interpreter goes through the program line by line and executes each command.</p><p>Want to give it a try? Let’s create a super simple programming language together that outputs magenta-colored output in the console. We’ll call it <strong>Magenta</strong>.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644233769692_OnPaste.20220207-173602.png?resize=592%2C302&amp;ssl=1\" alt=\"Screenshot of terminal output in color magenta.\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644233769692_OnPaste.20220207-173602.png?w=592&amp;ssl=1 592w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644233769692_OnPaste.20220207-173602.png?resize=300%2C153&amp;ssl=1 300w\" sizes=\"100vw\" width=\"592\"></p><p>&nbsp;</p><p>&nbsp;</p><p>Our simple programming language creates a codes variable that contains text that gets printed to the console… in magenta, of course.</p><h3><strong>Setting up our programming language</strong></h3><p>I am going to use Node.js but you can use any language to follow along, the concept will remain the same. Let me start by creating an index.js file and set things up.</p><p>class Magenta { &nbsp;constructor(codes) { &nbsp; &nbsp;this.codes = codes &nbsp;} &nbsp;run() { &nbsp; &nbsp;console.log(this.codes) &nbsp;} } <i>// For now, we are storing codes in a string variable called `codes`</i> <i>// Later, we will read codes from a file</i> const codes = `print \"hello world\" print \"hello again\"` const magenta = new Magenta(codes) magenta.run()</p><p>What we’re doing here is declaring a class called Magenta. That class defines and initiates an object that is responsible for logging text to the console with whatever text we provide it via a codes variable. And, for the time being, we’ve defined that codes variable directly in the file with a couple of “hello” messages.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644228498784_OnPaste.20220207-160729.png?resize=556%2C271&amp;ssl=1\" alt=\"Screenshot of terminal output.\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644228498784_OnPaste.20220207-160729.png?w=556&amp;ssl=1 556w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2022/05/s_202E5FF9B61E1911DBB7D9A33C31EAF25C613502CB267B4C9FC3E5DDF63D6AF9_1644228498784_OnPaste.20220207-160729.png?resize=300%2C146&amp;ssl=1 300w\" sizes=\"100vw\" width=\"556\"></p><p>&nbsp;</p><p>&nbsp;</p><p>If we were to run this code we would get the text stored in codes logged in the console.</p><p>OK, now we need to create a what’s called a Lexer.</p>",
      "category": "Coder",
      "createAt": "Sun Jun 12 2022 04:51:13 GMT+0700 (Giờ Đông Dương)"
    },
    {
      "id": 2,
      "title": "Adding Custom GitHub Badges to Your Repo",
      "subTitle": "If you’ve spent time looking at open-source repos on GitHub, you’ve probably noticed that most of them use badges in their README files. Take the official React repository, for instance. There are GitHub badges all over the README file that communicate important dynamic info, like the latest released version and whether the current build is passing.",
      "content": "<h3><strong>Badgen + Napkin</strong></h3><p>There’s plenty of ways to get your own HTTPS endpoint. You could spin up a server with DigitalOcean or AWS EC2, or you could use a serverless option like Google Cloud Functions or AWS Lambda; however, those can all still become a bit complex and tedious for our simple use case. That’s why I’m suggesting <a href=\"https://www.napkin.io/sandbox\">Napkin’s in-browser function editor</a> to code and deploy an endpoint without any installs or configuration.</p><p><a href=\"https://napkin.io/examples/bitcoin-badge\">Head over to Napkin’s Bitcoin badge example</a> to see an example endpoint. You can see the code to retrieve the current Bitcoin price and return it as JSON in the editor. You can run the code yourself from the editor or directly use the endpoint.</p><p>&nbsp;</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/image-9.png?resize=695%2C659&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/image-9.png?w=695&amp;ssl=1 695w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/image-9.png?resize=300%2C284&amp;ssl=1 300w\" sizes=\"100vw\" width=\"695\"></figure><p>&nbsp;</p><p>&nbsp;</p><p>To use the endpoint with Badgen, work with the same URL scheme from above, only this time with the Napkin endpoint:</p><p>https://badgen.net/https/napkin-examples.npkn.net/bitcoin-badge</p>",
      "category": "Trick-Css",
      "createAt": "Sun Jun 12 2022 04:54:28 GMT+0700 (Giờ Đông Dương)"
    },
    {
      "id": 3,
      "title": "Here’s why the columns aren’t equal",
      "subTitle": "Going back to our design scenario where we need three equal columns beneath a hero, we saw that the columns aren’t equal widths. That’s because flexbox starts by looking at the content size of each flex item before even thinking about shrinking them.",
      "content": "<blockquote><h3><strong>Here’s why the columns aren’t equal</strong></h3></blockquote><p>Going back to our design scenario where we need three equal columns beneath a hero, we saw that the columns aren’t equal widths. That’s because flexbox starts by looking at the content size of each flex item before even thinking about shrinking them.</p><blockquote><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=425%2C353&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?w=850&amp;ssl=1 850w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=300%2C249&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=768%2C637&amp;ssl=1 768w\" sizes=\"100vw\" width=\"425\"></p><p>&nbsp;</p><p>&nbsp;</p><p>Using Firefox’s DevTools (because it’s got some unique flexbox visualizations that others don’t), we can actually see how flexbox is calculating everything.</p><p>For simplicity’s sake, as we dive deeper into this, let’s work with some nice round numbers. We can do this by declaring widths on our flex items. <strong>When we declare a width on a flex item, we throw that intrinsic size out the window, as we’ve now declared an explicit value instead</strong>. This makes figuring out what’s really going on a lot easier.</p><p>In the Pen below, we have a parent that’s a 600px wide flexible container (display: flex). I’ve removed anything that might influence the numbers, so no gap or padding. I’ve also switched out the border for an outline so we can still visualize everything easily.</p><p>&nbsp;</p><p>The first and third flex items have a width: 300px and the middle one a width: 600px. If we add that all up, it’s a total of 1200px. That’s bigger than the the 600px available within the parent, so flex-shrink kicks in.</p><p>flex-shrink is a ratio. If everything has the same flex-shrink (which is 1 by default), they all shrink at the same rate. <strong>That doesn’t mean they all shrink to the same size or by the same amount</strong>, but they all shrink at the same rate.</p><p>If we jump back into Firefox DevTools, we can see the base size, the flex-shrink and the final size. In this case, the two 300px elements are now 150px, and the 600px one is now 300px.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=849%2C710&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?w=849&amp;ssl=1 849w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=300%2C251&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=768%2C642&amp;ssl=1 768w\" sizes=\"100vw\" width=\"849\">The two elements that have a base width of&nbsp;300px&nbsp;become&nbsp;150px.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=846%2C698&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?w=846&amp;ssl=1 846w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=300%2C248&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=768%2C634&amp;ssl=1 768w\" sizes=\"100vw\" width=\"846\"></p><p>&nbsp;</p><p>The larger element with a base width of&nbsp;600px&nbsp;becomes&nbsp;300px.</p><p>If we add up all the base sizes of all three flex items (the actual widths we declared on them), the total comes out to 1200px. Our flex container is 600px wide. If we divide everything by 2, it fits! <strong>They are all shrinking by the same rate, dividing their own widths by 2</strong>.</p><p>It’s not often that we have nice round numbers like that in the real world, but I think this does a nice job illustrating how flexbox does what it does when figuring out how big to make things.</p></blockquote>",
      "category": "Flex -Column",
      "createAt": "Sun Jun 12 2022 04:58:08 GMT+0700 (Giờ Đông Dương)"
    },
    {
      "id": 4,
      "title": "Here’s why the columns aren’t equal",
      "subTitle": "Going back to our design scenario where we need three equal columns beneath a hero, we saw that the columns aren’t equal widths. That’s because flexbox starts by looking at the content size of each flex item before even thinking about shrinking them.",
      "content": "<blockquote><h3><strong>Here’s why the columns aren’t equal</strong></h3></blockquote><p>Going back to our design scenario where we need three equal columns beneath a hero, we saw that the columns aren’t equal widths. That’s because flexbox starts by looking at the content size of each flex item before even thinking about shrinking them.</p><blockquote><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=425%2C353&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?w=850&amp;ssl=1 850w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=300%2C249&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622214548746_image.png?resize=768%2C637&amp;ssl=1 768w\" sizes=\"100vw\" width=\"425\"></p><p>&nbsp;</p><p>&nbsp;</p><p>Using Firefox’s DevTools (because it’s got some unique flexbox visualizations that others don’t), we can actually see how flexbox is calculating everything.</p><p>For simplicity’s sake, as we dive deeper into this, let’s work with some nice round numbers. We can do this by declaring widths on our flex items. <strong>When we declare a width on a flex item, we throw that intrinsic size out the window, as we’ve now declared an explicit value instead</strong>. This makes figuring out what’s really going on a lot easier.</p><p>In the Pen below, we have a parent that’s a 600px wide flexible container (display: flex). I’ve removed anything that might influence the numbers, so no gap or padding. I’ve also switched out the border for an outline so we can still visualize everything easily.</p><p>&nbsp;</p><p>The first and third flex items have a width: 300px and the middle one a width: 600px. If we add that all up, it’s a total of 1200px. That’s bigger than the the 600px available within the parent, so flex-shrink kicks in.</p><p>flex-shrink is a ratio. If everything has the same flex-shrink (which is 1 by default), they all shrink at the same rate. <strong>That doesn’t mean they all shrink to the same size or by the same amount</strong>, but they all shrink at the same rate.</p><p>If we jump back into Firefox DevTools, we can see the base size, the flex-shrink and the final size. In this case, the two 300px elements are now 150px, and the 600px one is now 300px.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=849%2C710&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?w=849&amp;ssl=1 849w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=300%2C251&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215047836_image-1.png?resize=768%2C642&amp;ssl=1 768w\" sizes=\"100vw\" width=\"849\">The two elements that have a base width of&nbsp;300px&nbsp;become&nbsp;150px.</p><p>&nbsp;</p><p>&nbsp;</p><p><img src=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=846%2C698&amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?w=846&amp;ssl=1 846w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=300%2C248&amp;ssl=1 300w, https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/06/s_1892609E7C85427425C71257B0B2EE5E49AECF3D7269C5FAE0F963DD3F719B38_1622215064744_image.png?resize=768%2C634&amp;ssl=1 768w\" sizes=\"100vw\" width=\"846\"></p><p>&nbsp;</p><p>The larger element with a base width of&nbsp;600px&nbsp;becomes&nbsp;300px.</p><p>If we add up all the base sizes of all three flex items (the actual widths we declared on them), the total comes out to 1200px. Our flex container is 600px wide. If we divide everything by 2, it fits! <strong>They are all shrinking by the same rate, dividing their own widths by 2</strong>.</p><p>It’s not often that we have nice round numbers like that in the real world, but I think this does a nice job illustrating how flexbox does what it does when figuring out how big to make things.</p></blockquote>",
      "category": "Flex -Column",
      "createAt": "Sun Jun 12 2022 04:58:08 GMT+0700 (Giờ Đông Dương)"
    }
  ],
  "category": [
    {}
  ],
  "cart": [
    {
      "name": "Nguyên Tắc 50 - Không Sợ Hãi (Tái Bản 2022)",
      "img": "https://cdn0.fahasa.com/media/catalog/product/8/9/8934974181545.jpg",
      "description": "Sợ hãi là một trong những cảm xúc nguyên thủy nhất mà mỗi người cảm nhận được ngay từ lúc chào đời. Không ai thoát khỏi quy luật chung này. Vì vậy, vượt qua sợ hãi, với tất cả hình thức cung bậc đa dạng của nó, không phải là điều tự nhiên đến mà là kết quả của một quá trình nỗ lực kiên trì, có ý thức, có phương pháp. Robert Greene đã trình bày trong cuốn sách của mình, thông qua 10 chương sách, 10 chiến lược hành động khác nhau để vượt qua những khía cạnh khác nhau của cảm giác sợ hãi. Những gì được viết ra trong cuốn sách không phải là điều gì mới lạ do tác giả phát minh ra, mà đơn thuần chỉ là sự tổng kết có hệ thống những phương cách mà nhiều nhân vật nổi tiếng trong lịch sử thuộc mọi lĩnh vực - từ chính trị, quân sự đến kinh doanh, từ thể thao đỉnh cao đến nghiên cứu khoa học – đã áp dụng thành công để vượt qua nỗi sợ hãi của chính họ nhằm tiến tới thành công. Bên cạnh những khuôn mặt nổi tiếng trong lịch sử, Greene dẫn dắt bạn đọc theo con đường vươn lên của ca sĩ nổi tiếng 50 Cent từ một đứa trẻ lang thang bán ma túy trên đường phố trở thành ông chủ đầy quyền lực của một đế chế kinh doanh phát đạt, cũng như cách mà anh vượt qua những thử thách mới, những nỗi sợ hãi mới gặp phải trong mỗi giai đoạn của cuộc sống.  Mã hàng\t8934974181545 Tên Nhà Cung Cấp\tNXB Trẻ Tác giả\t50 Cent, Robert Greene Người Dịch\tLê Đình Chi NXB\tTrẻ Năm XB\t2022 Trọng lượng (gr)\t350 Kích Thước Bao Bì\t20.5 x 13 x 1.5 Số trang\t336 Hình thức\tBìa Mềm Sản phẩm hiển thị trong\t NXB Trẻ Sản phẩm bán chạy nhất\tTop 100 sản phẩm Kỹ năng sống bán chạy của tháng Giá sản phẩm trên Fahasa.com đã bao gồm thuế theo luật hiện hành. Bên cạnh đó, tuỳ vào loại sản phẩm, hình thức và địa chỉ giao hàng mà có thể phát sinh thêm chi phí khác như Phụ phí đóng gói, phí vận chuyển, phụ phí hàng cồng kềnh,... Chính sách khuyến mãi trên Fahasa.com không áp dụng cho Hệ thống Nhà sách Fahasa trên toàn quốc Sợ hãi là một trong những cảm xúc nguyên thủy nhất mà mỗi người cảm nhận được ngay từ lúc chào đời. Không ai thoát khỏi quy luật chung này. Vì vậy, vượt qua sợ hãi, với tất cả hình thức cung bậc đa dạng của nó, không phải là điều tự nhiên đến mà là kết quả của một quá trình nỗ lực kiên trì, có ý thức, có phương pháp. Robert Greene đã trình bày trong cuốn sách của mình, thông qua 10 chương sách, 10 chiến lược hành động khác nhau để vượt qua những khía cạnh khác nhau của cảm giác sợ hãi. Những gì được viết ra trong cuốn sách không phải là điều gì mới lạ do tác giả phát minh ra, mà đơn thuần chỉ là sự tổng kết có hệ thống những phương cách mà nhiều nhân vật nổi tiếng trong lịch sử thuộc mọi lĩnh vực - từ chính trị, quân sự đến kinh doanh, từ thể thao đỉnh cao đến nghiên cứu khoa học – đã áp dụng thành công để vượt qua nỗi sợ hãi của chính họ nhằm tiến tới thành công. Bên cạnh những khuôn mặt nổi tiếng trong lịch sử, Greene dẫn dắt bạn đọc theo con đường vươn lên của ca sĩ nổi tiếng 50 Cent từ một đứa trẻ lang thang bán ma túy trên đường phố trở thành ông chủ đầy quyền lực của một đế chế kinh doanh phát đạt, cũng như cách mà anh vượt qua những thử thách mới, những nỗi sợ hãi mới gặp phải trong mỗi giai đoạn của cuộc sống.",
      "author": "50 Cent, Robert Greene",
      "category": "",
      "quantity": 1,
      "price": "130000",
      "status": true,
      "id": 1,
      "sale": "110500"
    }
  ]
}